Практос_2/src/DataProcessors/РабочееМестоРекрутера/РабочееМестоРекрутера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоРекрутера</name>
  <attributes>
    <name>ТекущаяВакансия</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Открыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОжидании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Практос_2/src/Enums/СтатусОпубликованнойВакансии/СтатусОпубликованнойВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусОпубликованнойВакансии</name>
  <enumValues>
    <name>Открыта</name>
  </enumValues>
  <enumValues>
    <name>ПоискСотрудника</name>
  </enumValues>
  <enumValues>
    <name>ВОжидании</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

Практос_2/src/Documents/ПубликацияВакансии/ПубликацияВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПубликацияВакансии</name>
  <basedOn>Document.ЗаявкаНаПодбор</basedOn>
  <registerRecords>AccumulationRegister.БюджетМаркетингаHR</registerRecords>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаПодбор</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Рубли</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОпубликованнойВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратНаПодбор</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникПривлечения</name>
      <type>
        <types>CatalogRef.ИсточникПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Рубли</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Практос_2/src/DataProcessors/РабочееМестоРекрутера/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
Объект.Открыта = истина;
Объект.ПоискСотрудника = истина;
Объект.ВОжидании = истина;
Объект.Отменена = истина; 
Объект.Закрыта = истина;
ЗаполнениеТЗ();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнениеТЗ()
МассивСтатусов = Новый Массив;
Если Объект.Открыта = Истина тогда
    МассивСтатусов.Добавить(Перечисления.СтатусОпубликованнойВакансии.Открыта);
КонецЕсли;
Если Объект.ПоискСотрудника = Истина тогда
	МассивСтатусов.Добавить(Перечисления.СтатусОпубликованнойВакансии.ПоискСотрудника);
КонецЕсли;
Если Объект.Отменена = Истина тогда
	МассивСтатусов.Добавить(Перечисления.СтатусОпубликованнойВакансии.Отменена); 
КонецЕсли;
Если Объект.ВОжидании = Истина тогда
    МассивСтатусов.Добавить(Перечисления.СтатусОпубликованнойВакансии.ВОжидании);
КонецЕсли;
Если Объект.Закрыта = Истина тогда
    МассивСтатусов.Добавить(Перечисления.СтатусОпубликованнойВакансии.Закрыта);
КонецЕсли;

ВыбранныйСотрудник = Объект.Сотрудник;
НужноФильтроватьПоСотруднику = ЗначениеЗаполнено(ВыбранныйСотрудник);

	Запрос = Новый Запрос;
Запрос.Текст = 
    "ВЫБРАТЬ
    |	ПубликацияВакансии.Вакансия КАК Вакансия,
    |	ПубликацияВакансии.Дата КАК Дата,
    |	ПубликацияВакансии.Ответственный КАК Ответственный,
    |	ПубликацияВакансии.ДатаНачалаРазмещения КАК ДатаНачалаРазмещения,
    |	ПубликацияВакансии.ДатаОкончанияРазмещения КАК ДатаОкончанияРазмещения,
    |	ПубликацияВакансии.Статус КАК Статус,
    |	ПубликацияВакансии.Ссылка КАК Ссылка,
    |	ПубликацияВакансии.Организация КАК Организация
    |ИЗ
    |	Документ.ПубликацияВакансии КАК ПубликацияВакансии
    |ГДЕ 
	|	(ПубликацияВакансии.Ответственный = &Сотрудник ИЛИ &ВыбранныйСотрудник = ЛОЖЬ)
    |	И ПубликацияВакансии.Статус В (&СписокСтатусов)"; 

Запрос.УстановитьПараметр("СписокСтатусов", МассивСтатусов);	    

Запрос.УстановитьПараметр("Сотрудник", ВыбранныйСотрудник);
Запрос.УстановитьПараметр("ВыбранныйСотрудник", НужноФильтроватьПоСотруднику);

РезультатЗапроса = Запрос.Выполнить();
Результат = РезультатЗапроса.Выгрузить();
ТаблицаКандидатов.Загрузить(РезультатЗапроса.Выгрузить());	

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнениеТЗ()
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКандидатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
			// Получаем данные текущей строки
 		   ТекущаяСтрокаДанных = Элемент.ДанныеСтроки(ВыбраннаяСтрока);    
   		 // Проверяем, что строка не пустая
  		 Если ТекущаяСтрокаДанных <> Неопределено Тогда
        
        // Пытаемся открыть ссылку из колонки "Ссылка"
        // (убедитесь, что имя колонки в Элементах формы именно "Ссылка")
        Если ЗначениеЗаполнено(ТекущаяСтрокаДанных.Ссылка) Тогда
            
            // Стандартная команда 1С: открыть форму объекта по ссылке
            ОткрытьЗначение(ТекущаяСтрокаДанных.Ссылка);
            
            // Отключаем стандартную обработку, так как мы сами открыли форму
            СтандартнаяОбработка = Ложь;
            
        КонецЕсли;
        
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаПриИзменении(Элемент)
	Статус = Объект.Закрыта;// Вставить содержимое обработчика. 
	ЗаполнениеТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ОтмененаПриИзменении(Элемент)
	ЗаполнениеТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ВОжиданииПриИзменении(Элемент)
	ЗаполнениеТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ПоискСотрудникаПриИзменении(Элемент)
	ЗаполнениеТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытаПриИзменении(Элемент)
	ЗаполнениеТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьтекущегоСотрудника(Команда)
	ОпределитьтекущегоСотрудникаНаСервере();// Выбрать текущего юзера, обновить форму    
КонецПроцедуры   

&НаСервере
Процедура ОпределитьтекущегоСотрудникаНаСервере()  
	// 1. Получаем имя пользователя из системы 1С
    ИмяПользователяСистемы = ИмяПользователя();
    
    // 2. Ищем элемент в справочнике "Рекрутеры" (замените на ваш справочник)
    // Метод НайтиПоНаименованию ищет по полю "Наименование"
    НайденныйСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ИмяПользователяСистемы);
    
    // 3. Возвращаем найденную ссылку
	//Возврат НайденныйСотрудник;
	//ПолучитьИмяПользователя();// Выбрать текущего юзера, обновить форму 
	
	 НайтиРекрутераПоРеквизиту(ИмяПользователяСистемы);
	 Объект.Сотрудник = НайтиРекрутераПоРеквизиту(ИмяПользователяСистемы);
	 ЗаполнениеТЗ();
КонецПроцедуры   


&НаСервере
Функция НайтиРекрутераПоРеквизиту(ИмяПользователяСистемы)  
	
	Запрос = Новый Запрос;
    Запрос.Текст =  
	"ВЫБРАТЬ
	|Сотрудники.Ссылка КАК Ссылка,
	|Сотрудники.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|Сотрудники.УчетнаяЗапись = &ИмяПользователяСистемы";
	
    
    Запрос.УстановитьПараметр("ИмяПользователяСистемы", ИмяПользователяСистемы);
    
    РезультатЗапроса = Запрос.Выполнить();
	//Результат = РезультатЗапроса.Выгрузить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
        Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.Ссылка; // Возвращаем найденную ссылку
    Иначе
        Возврат Справочники.Сотрудники.ПустаяСсылка(); // Если не нашли
    КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура HRСотрудникПриИзменении(Элемент)
	ЗаполнениеТЗ(); //обновлять форму
КонецПроцедуры
